## :x: Apply Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/21168395433)



<pre><code>Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/00meukdy10z0qky&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/00meukdy10z0qky&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 3, in resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_sa_to_hierarchical_group&#34;:
   3: resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_sa_to_hierarchical_group&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/03fwokq04jj0scm&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/03fwokq04jj0scm&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 15, in resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_sa_to_hierarchical_group&#34;:
  15: resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_sa_to_hierarchical_group&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com&#39; in &#39;groups/01fob9te0l19xwg&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com&#39; in &#39;groups/01fob9te0l19xwg&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.image_builder_restricted_markets_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 27, in resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_restricted_markets_sa_to_hierarchical_group&#34;:
  27: resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_restricted_markets_sa_to_hierarchical_group&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-security-scanners@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-security-scanners@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.security_scanners_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 54, in resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_group_to_prod_read&#34;:
  54: resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_group_to_prod_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-security-scanners@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-security-scanners@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.security_scanners_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 66, in resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_group_to_dev_read&#34;:
  66: resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_group_to_dev_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-developers@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-developers@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.developers_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 78, in resource &#34;google_cloud_identity_group_membership&#34; &#34;developers_group_to_prod_read&#34;:
  78: resource &#34;google_cloud_identity_group_membership&#34; &#34;developers_group_to_prod_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-developers@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-developers@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.developers_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 90, in resource &#34;google_cloud_identity_group_membership&#34; &#34;developers_group_to_dev_read&#34;:
  90: resource &#34;google_cloud_identity_group_membership&#34; &#34;developers_group_to_dev_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-markets-delivery@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-markets-delivery@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.markets_delivery_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 102, in resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_group_to_prod_read&#34;:
 102: resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_group_to_prod_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 127, in resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_dev_read&#34;:
 127: resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_dev_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/023ckvvd0rmgw6a&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/023ckvvd0rmgw6a&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_dev_write,
  on restricted-registry-hierarchical-groups.tf line 139, in resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_dev_write&#34;:
 139: resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_dev_write&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 151, in resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_prod_read&#34;:
 151: resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_prod_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/01egqt2p1a2johw&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/01egqt2p1a2johw&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_prod_write,
  on restricted-registry-hierarchical-groups.tf line 162, in resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_prod_write&#34;:
 162: resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_prod_write&#34; {

::error::OpenTofu exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.github_organization.kyma_project: Reading...
github_actions_variable.github_terraform_planner_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_PLANNER_SECRET_NAME]
github_actions_organization_variable.image_builder_ado_pat_gcp_secret_name: Refreshing state... [id=IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME]
github_actions_variable.github_terraform_executor_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_EXECUTOR_SECRET_NAME]
data.github_repository.gitleaks_repository["test-infra"]: Reading...
data.github_repository.test_infra: Reading...
github_actions_organization_variable.gcp_kyma_project_project_id: Refreshing state... [id=GCP_KYMA_PROJECT_PROJECT_ID]
data.github_organization.kyma_internal: Reading...
data.github_repository.kyma_modules_internal: Reading...
data.github_repository.restricted_markets_docu_hub: Reading...
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Refreshing state... [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
module.chainguard_cache.data.google_client_config.this: Reading...
module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/prod]
module.chainguard_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.docker_cache.data.google_client_config.this: Reading...
module.docker_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dev_docker_repository.data.google_client_config.this: Reading...
module.dev_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_project_iam_member.kyma_developer_admin_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.viewer/group:kyma_developer_admin@sap.com]
google_project_iam_member.kyma_developer_admin_editor: Refreshing state... [id=kyma-project/roles/editor/group:kyma_developer_admin@sap.com]
module.kyma_restricted_images_dev.data.google_client_config.this: Reading...
module.kyma_restricted_images_dev.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules]
module.kyma_modules.data.google_client_config.this: Reading...
module.kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dockerhub_mirror.data.google_client_config.this: Reading...
module.dockerhub_mirror.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_restricted_images_dev.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-dev]
data.github_repository.kyma_modules_internal: Read complete after 1s [id=kyma-modules]
google_service_account.kyma_project_image_builder: Refreshing state... [id=projects/kyma-project/serviceAccounts/azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
module.kyma_restricted_images_prod.data.google_client_config.this: Reading...
module.kyma_restricted_images_prod.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_service_account.kyma_project_image_builder_restricted_markets: Refreshing state... [id=projects/kyma-project/serviceAccounts/img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com]
module.docker_cache.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/cache]
module.dev_kyma_modules.data.google_client_config.this: Reading...
module.dev_kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev]
module.kyma_restricted_images_prod.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-prod]
data.github_repository.restricted_markets_docu_hub: Read complete after 1s [id=product-kyma-runtime-fork]
module.prod_docker_repository.data.google_client_config.this: Reading...
module.prod_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_project_iam_member.kyma_developer_admin_private_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.privateLogViewer/group:kyma_developer_admin@sap.com]
module.kyma_modules.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules]
data.google_project.kyma_project: Reading...
google_service_account.gitleaks_secret_accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_project.kyma_project: Read complete after 0s [id=projects/kyma-project]
module.security_dashboard_token.data.google_iam_policy.noauth: Reading...
module.security_dashboard_token.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
google_service_account.sa-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
google_service_account.gitleaks-secret-accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.dora_integration_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/dora-integration-gh-tools-serviceuser-token]
google_secret_manager_secret.internal_github_terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-planner-token]
google_secret_manager_secret.internal_github_terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-executor-token]
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Reading...
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 1s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
google_secret_manager_secret.kyma_modules_runtime_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-prow-serviceuser-internal-github-token]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 1s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.image_syncer_writer: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
google_service_account.neighbors-conduit-cli-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/neighbors-conduit-cli-builder@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-dev-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-dev-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sec-scanner-cfg-processor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sec-scanner-cfg-processor@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.sa-security-dashboard-oauth: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-security-dashboard-oauth@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Read complete after 0s [id=projects/351981214969/secrets/docker_sap_org_service_auth_token/versions/1]
google_secret_manager_secret.kyma_bot_public_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-bot-github-public-repo-token]
module.signify_secret_rotator.google_service_account.signify_secret_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
google_service_account.restricted-markets-artifactregistry-reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
data.github_repository.gitleaks_repository["test-infra"]: Read complete after 2s [id=test-infra]
module.signify_secret_rotator.data.google_project.project: Reading...
module.service_account_keys_rotator.data.google_project.project: Reading...
module.service_account_keys_cleaner.data.google_project.project: Reading...
google_pubsub_topic.secrets_rotator_dead_letter: Refreshing state... [id=projects/sap-kyma-prow/topics/secrets-rotator-dead-letter]
google_service_account.sa-secret-update: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-secret-update@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 0s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
google_service_account.image_syncer_reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
google_service_account.kyma-submission-pipeline: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
data.github_repository.test_infra: Read complete after 2s [id=test-infra]
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
google_service_account.kyma-security-scanners: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.kyma-oci-image-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.kyma-modules-reader-modg: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/modg-vuln-mgmt-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
data.google_client_config.gcp: Reading...
module.service_account_keys_rotator.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.terraform-planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Refreshing state... [id=locations/europe-west1/namespaces/sap-kyma-prow/services/security-dashboard-token]
google_secret_manager_secret.sec-scanner-cfg-processor-gcp-sa-key: Refreshing state... [id=projects/sap-kyma-prow/secrets/sec-scanner-cfg-gcp-sa-key]
google_service_account.secrets-rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.image_builder_sa_key_restricted_markets: Refreshing state... [id=projects/sap-kyma-prow/secrets/image-builder-sa-key-restricted-markets]
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.chainguard_pull_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token]
google_service_account.terraform-executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
data.google_project.current: Reading...
google_secret_manager_secret.doc_collector_internal_github_token: Preparing import... [id=projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token]
google_secret_manager_secret.doc_collector_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
github_actions_variable.internal_github_terraform_planner_secret_name: Refreshing state... [id=test-infra:INTERNAL_GITHUB_TERRAFORM_PLANNER_SECRET_NAME]
github_actions_organization_variable.dora_integration_internal_github_token_gcp_secret_name: Refreshing state... [id=DORA_INTEGRATION_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME]
github_actions_variable.internal_github_terraform_executor_secret_name: Refreshing state... [id=test-infra:INTERNAL_GITHUB_TERRAFORM_EXECUTOR_SECRET_NAME]
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.signify_secret_rotator.google_monitoring_alert_policy.signify_secret_rotator_error_alert: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/5685251492968365145]
module.service_account_keys_rotator.google_monitoring_alert_policy.service_account_keys_rotator_error_alert: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/8834342864758449670]
data.google_project.current: Read complete after 0s [id=projects/sap-kyma-prow]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator]
google_secret_manager_secret_iam_member.kyma_modules_update_components_workflow_internal_token_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-prow-serviceuser-internal-github-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/subject/repository_id:172960:repository_owner_id:2457:workflow:Update Component Version on Push]
github_actions_variable.kyma_modules_runtime_internal_github_token_gcp_secret_name: Refreshing state... [id=kyma-modules:KYMA_PROW_SERVICEUSER_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME]
github_actions_organization_variable.image_syncer_writer_service_account_email: Refreshing state... [id=IMAGE_SYNCER_WRITER_SERVICE_ACCOUNT_EMAIL]
github_actions_organization_variable.dora_integration_public_github_token_gcp_secret_name: Refreshing state... [id=DORA_INTEGRATION_PUBLIC_GITHUB_TOKEN_GCP_SECRET_NAME]
google_service_account_iam_member.restricted_markets_artifactregistry_reader_impersonation: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:gcr-writer@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.signify_secret_rotator.google_cloud_run_service.signify_secret_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/signify-secret-rotator]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.kyma_autobump_bot_github_token_secret_name: Refreshing state... [id=test-infra:KYMA_AUTOBUMP_BOT_GITHUB_SECRET_NAME]
github_actions_organization_variable.image_syncer_reader_service_account_email: Refreshing state... [id=IMAGE_SYNCER_READER_SERVICE_ACCOUNT_EMAIL]
module.signify_secret_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_accessor: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretAccessor/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_adder: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionAdder/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_proje

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

elivery_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "markets_delivery_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/03fwokq04jj0scm"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_dev_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_group_to_dev_read" {
      + create_time = (known after apply)
      + group       = "groups/0184mhaj2tdduaw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-security-scanners@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-security-scanners@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/00meukdy10z0qky"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_secret_manager_secret.doc_collector_internal_github_token will be updated in-place
  # (imported from "projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token")
  ~ resource "google_secret_manager_secret" "doc_collector_internal_github_token" {
        annotations           = {}
        create_time           = "2025-08-29T11:26:20.129527Z"
        effective_annotations = {}
      ~ effective_labels      = {
          ~ "component"       = "workflow" -> "github-workflow"
            "entity"          = "technical-writers-docuforge-serviceuser"
          + "github-instance" = "internal"
            "owner"           = "neighbors"
          ~ "tool"            = "docuforge" -> "doc-collector"
          ~ "type"            = "serviceuser-token" -> "github-token"
        }
        id                    = "projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token"
      ~ labels                = {
          + "component"       = "github-workflow"
          + "github-instance" = "internal"
          + "owner"           = "neighbors"
          + "tool"            = "doc-collector"
          + "type"            = "github-token"
        }
        name                  = "projects/351981214969/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token"
        project               = "sap-kyma-prow"
        secret_id             = "technical-writers-docsync-workflow-gh-tools-neighbors-token"
      ~ terraform_labels      = {
          + "component"       = "github-workflow"
          + "github-instance" = "internal"
          + "owner"           = "neighbors"
          + "tool"            = "doc-collector"
          + "type"            = "github-token"
        }
        version_aliases       = {}

        replication {
            auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.doc_collector_workflow_internal_token_reader will be created
  + resource "google_secret_manager_secret_iam_member" "doc_collector_workflow_internal_token_reader" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/subject/repository_id:480143:repository_owner_id:2457:workflow:doc-collector"
      + project   = "sap-kyma-prow"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "technical-writers-docsync-workflow-gh-tools-neighbors-token"
    }

  # google_secret_manager_secret_iam_member.doc_collector_workflow_public_token_reader will be created
  + resource "google_secret_manager_secret_iam_member" "doc_collector_workflow_public_token_reader" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/subject/repository_id:480143:repository_owner_id:2457:workflow:doc-collector"
      + project   = "sap-kyma-prow"
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "kyma-bot-github-public-repo-token"
    }

Plan: 1 to import, 16 to add, 1 to change, 0 to destroy.
google_secret_manager_secret.doc_collector_internal_github_token: Importing... [id=projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token]
google_secret_manager_secret.doc_collector_internal_github_token: Import complete [id=projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token]
google_cloud_identity_group_membership.developers_group_to_prod_read: Creating...
google_cloud_identity_group_membership.security_scanners_group_to_prod_read: Creating...
google_cloud_identity_group_membership.image_builder_group_to_prod_read: Creating...
google_cloud_identity_group_membership.image_signer_group_to_prod_read: Creating...
google_cloud_identity_group_membership.image_builder_group_to_prod_write: Creating...
google_cloud_identity_group_membership.image_builder_group_to_dev_write: Creating...
google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group: Creating...
google_cloud_identity_group_membership.security_scanners_group_to_dev_read: Creating...
google_secret_manager_secret.doc_collector_internal_github_token: Modifying... [id=projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token]
google_cloud_identity_group_membership.image_builder_group_to_dev_read: Creating...
google_cloud_identity_group_membership.markets_delivery_group_to_prod_read: Creating...
google_cloud_identity_group_membership.developers_group_to_dev_read: Creating...
google_secret_manager_secret.doc_collector_internal_github_token: Modifications complete after 1s [id=projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token]
google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group: Creating...
google_secret_manager_secret_iam_member.doc_collector_workflow_public_token_reader: Creating...
google_secret_manager_secret_iam_member.doc_collector_workflow_internal_token_reader: Creating...
google_cloud_identity_group_membership.azure_pipeline_image_builder_sa_to_hierarchical_group: Creating...
google_cloud_identity_group_membership.image_builder_restricted_markets_sa_to_hierarchical_group: Creating...
google_cloud_identity_group_membership.image_signer_group_to_prod_read: Creation complete after 1s [id=groups/00xvir7l1dtv8ew/memberships/01yyy98l2u8q924]
google_cloud_identity_group_membership.azure_pipeline_image_builder_sa_to_hierarchical_group: Creation complete after 1s [id=groups/01yyy98l2u8q924/memberships/103311426355882746849]
google_secret_manager_secret_iam_member.doc_collector_workflow_internal_token_reader: Creation complete after 4s [id=projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/subject/repository_id:480143:repository_owner_id:2457:workflow:doc-collector]
google_secret_manager_secret_iam_member.doc_collector_workflow_public_token_reader: Creation complete after 4s [id=projects/sap-kyma-prow/secrets/kyma-bot-github-public-repo-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/subject/repository_id:480143:repository_owner_id:2457:workflow:doc-collector]

Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/00meukdy10z0qky' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/00meukdy10z0qky' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 3, in resource "google_cloud_identity_group_membership" "security_scanners_sa_to_hierarchical_group":
   3: resource "google_cloud_identity_group_membership" "security_scanners_sa_to_hierarchical_group" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/03fwokq04jj0scm' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/03fwokq04jj0scm' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 15, in resource "google_cloud_identity_group_membership" "markets_delivery_sa_to_hierarchical_group":
  15: resource "google_cloud_identity_group_membership" "markets_delivery_sa_to_hierarchical_group" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com' in 'groups/01fob9te0l19xwg' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com' in 'groups/01fob9te0l19xwg' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.image_builder_restricted_markets_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 27, in resource "google_cloud_identity_group_membership" "image_builder_restricted_markets_sa_to_hierarchical_group":
  27: resource "google_cloud_identity_group_membership" "image_builder_restricted_markets_sa_to_hierarchical_group" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-security-scanners@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-security-scanners@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.security_scanners_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 54, in resource "google_cloud_identity_group_membership" "security_scanners_group_to_prod_read":
  54: resource "google_cloud_identity_group_membership" "security_scanners_group_to_prod_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-security-scanners@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-security-scanners@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.security_scanners_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 66, in resource "google_cloud_identity_group_membership" "security_scanners_group_to_dev_read":
  66: resource "google_cloud_identity_group_membership" "security_scanners_group_to_dev_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-developers@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-developers@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.developers_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 78, in resource "google_cloud_identity_group_membership" "developers_group_to_prod_read":
  78: resource "google_cloud_identity_group_membership" "developers_group_to_prod_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-developers@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-developers@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.developers_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 90, in resource "google_cloud_identity_group_membership" "developers_group_to_dev_read":
  90: resource "google_cloud_identity_group_membership" "developers_group_to_dev_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-markets-delivery@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-markets-delivery@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.markets_delivery_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 102, in resource "google_cloud_identity_group_membership" "markets_delivery_group_to_prod_read":
 102: resource "google_cloud_identity_group_membership" "markets_delivery_group_to_prod_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 127, in resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_read":
 127: resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/023ckvvd0rmgw6a' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/023ckvvd0rmgw6a' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_dev_write,
  on restricted-registry-hierarchical-groups.tf line 139, in resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_write":
 139: resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_write" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 151, in resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_read":
 151: resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/01egqt2p1a2johw' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/01egqt2p1a2johw' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_prod_write,
  on restricted-registry-hierarchical-groups.tf line 162, in resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_write":
 162: resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_write" {

::error::OpenTofu exited with code 1.

```

</details>

`

<!-- github-comment: {"Command":"apply","JobName":"post-apply-prod-terraform","PRNumber":13749,"Program":"tfcmt","SHA1":"aa2486639bddb64ab9f4f258e2bd1e838fcae63c","Vars":{},"WorkflowName":"Post Apply Prod Terraform"} -->